In [2]:
import pandas as pd
import numpy as np

In [ ]:
pandas.DataFrame.take

DataFrame.take(indices, axis=0, **kwargs)

indices: array-like
An array of ints indicating which positions to take.

axis : {0 or ‘index’, 1 or ‘columns’, None}, default 0
       The axis on which to select elements. 
       0 means that we are selecting rows,
       1 means that we are selecting columns.
       For Series this parameter is unused and defaults to 0.

In [3]:
df = pd.DataFrame([('falcon', 'bird', 389.0),
                   ('parrot', 'bird', 24.0),
                   ('lion', 'mammal', 80.5),
                   ('monkey', 'mammal', np.nan)],
                  columns=['name', 'class', 'max_speed'],
                  index=[0, 2, 3, 1])
df

     name   class  max_speed
0  falcon    bird      389.0
2  parrot    bird       24.0
3    lion  mammal       80.5
1  monkey  mammal        NaN

In [4]:
df.take([0, 3])

     name   class  max_speed
0  falcon    bird      389.0
1  monkey  mammal        NaN

In [5]:
df.take([1, 2], axis=1)

    class  max_speed
0    bird      389.0
2    bird       24.0
3  mammal       80.5
1  mammal        NaN

In [6]:
df.take([-1, -2])

     name   class  max_speed
1  monkey  mammal        NaN
3    lion  mammal       80.5